Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Terraform plans
<details><summary>plprobelab</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_membership.this["dennis-tra"] will be created
  + resource "github_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "admin"
      + username = "dennis-tra"
    }

  # github_membership.this["galargh"] will be created
  + resource "github_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "admin"
      + username = "galargh"
    }

  # github_membership.this["guillaumemichel"] will be created
  + resource "github_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "admin"
      + username = "guillaumemichel"
    }

  # github_membership.this["iand"] will be created
  + resource "github_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "admin"
      + username = "iand"
    }

  # github_membership.this["yiannisbot"] will be created
  + resource "github_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "admin"
      + username = "yiannisbot"
    }

  # github_team.this["probelab-core"] will be created
  + resource "github_team" "this" {
      + create_default_maintainer = false
      + description               = "Members of the ProbeLab team at Protocol Labs"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "probelab-core"
      + node_id                   = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team_membership.this["probelab-core:dennis-tra"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "dennis-tra"
    }

  # github_team_membership.this["probelab-core:guillaumemichel"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "guillaumemichel"
    }

  # github_team_membership.this["probelab-core:iand"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "iand"
    }

  # github_team_membership.this["probelab-core:yiannisbot"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "yiannisbot"
    }

Plan: 10 to add, 0 to change, 0 to destroy.
```

</details>
<!-- Sticky Pull Request Comment -->